app/views/posts/_form.html.erb

<%= form_for @post, :html => { :class => 'form-horizontal' } do |f| %>
  <%= hidden_field_tag "access_token", ApiKey.first.try(:access_token).to_s  %>
---
SELECT "api_keys".* FROM "api_keys" WHERE "api_keys"."access_token" = 'cb19cbf6761e9bac48a8441573b143c4' LIMIT 1