app/controllers/posts_controller.rb

  def index
    @search = params[:search].to_s
    @posts = Post.find(:all, :conditions => [" posts.title LIKE ? ", "%#{@search.to_s.downcase}%"])
---
SELECT "posts".* FROM "posts" WHERE ( posts.title LIKE '%abc%' )

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 27 Jun 2013 17:07:27 UTC +00:00], ["description", "defsdfdsfsdf"], ["title", "abc"], ["updated_at", Thu, 27 Jun 2013 17:07:27 UTC +00:00]]