app/controllers/tutes_controller.rb

  def index
    #@tutes = Tute.all.page(params[:page]).per(10)
    @search = params[:tute][:search] if params[:tute].present?
---
SELECT "tutes".* FROM "tutes" WHERE (( tutes.title LIKE '%%' OR tutes.episode LIKE '%%' OR tutes.general_type LIKE '%%') AND general_type = 'revised') ORDER BY episode desc

  def show
    @tute = Tute.find(params[:id])
---
SELECT "tutes".* FROM "tutes" WHERE "tutes"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @tute = Tute.find(params[:id])
---
SELECT "tutes".* FROM "tutes" WHERE "tutes"."id" = ? LIMIT 1  [["id", "1"]]